app/views/hair_stylists/show.html.erb

SELECT "services".* FROM "services" WHERE "services"."hair_stylist_id" = ?  [["hair_stylist_id", 1]]
---
  <% if logged_in? %>
    <% @hair_stylist.services.each do |service| %>

SELECT "services".* FROM "services" WHERE "services"."hair_stylist_id" = ?  [["hair_stylist_id", 1]]
---
<% else %>
  <% @hair_stylist.services.each do |service| %>