app/views/customers/edit.html.erb

  <%= f.label :hairtype %>
  <%= f.collection_select :hairtype_id, Hairtype.all, :id, :name %>
---
SELECT "hairtypes".* FROM "hairtypes"