app/views/customers/show.html.erb

  <h4>Upcoming Appointments</h4>
  <% @customer.appointments.each do |appointment|%>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."customer_id" = ?  [["customer_id", 6]]