app/controllers/appointments_controller.rb

  def new
    @appointment = Appointment.new
    @customer = Customer.find_by(id: session[:customer_id])
    @service = Service.find_by(id:params[:service_id])
    @hair_stylist = HairStylist.find_by(id:params[:service_id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "hair_stylists".* FROM "hair_stylists" WHERE "hair_stylists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @appointment = Appointment.new(appointment_params)
    @appointment.customer_id = session[:customer_id]
    @appointment.save
---
INSERT INTO "appointments" ("customer_id", "service_id", "datetime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 6], ["service_id", 9], ["datetime", "2019-01-04 02:53:55"], ["created_at", "2019-01-04 02:53:58.614668"], ["updated_at", "2019-01-04 02:53:58.614668"]]