app/controllers/customers_controller.rb

  def show
    #byebug
    @hairtype = Hairtype.find(@customer.hairtype_id).name
---
SELECT  "hairtypes".* FROM "hairtypes" WHERE "hairtypes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("name", "location", "hairtype_id", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "gabe"], ["location", "Brooklyn, NY"], ["hairtype_id", 7], ["email", "gaba@gaba.com"], ["created_at", "2019-01-03 14:31:44.083478"], ["updated_at", "2019-01-03 14:31:44.083478"]]

  def update
    @customer.update(customer_params)
---
UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Meowlan Sacher"], ["updated_at", "2019-01-02 14:39:03.929292"], ["id", 7]]

  def find_customer
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]