app/controllers/hairtypes_controller.rb

SELECT "hairtypes".* FROM "hairtypes"
---
  def index
    @hairtypes = Hairtype.all