app/controllers/hair_stylists_controller.rb

  def find_hair_stylist
    @hair_stylist = HairStylists.find(params[:id])
---
SELECT  "hair_stylists".* FROM "hair_stylists" WHERE "hair_stylists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]