app/controllers/salons_controller.rb

SELECT "salons".* FROM "salons"
---
  def index
    @salons = Salon.all

SELECT  "salons".* FROM "salons" WHERE "salons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_salon
    @salon = Salon.find(params[:id])